app/views/lists/show.html.erb


  <% @list.tasks.sort.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ?  [["list_id", 4]]