app/controllers/lists_controller.rb

	def index

		if !(cookies[:lists].nil?)
			@lists=Array.new()

			(cookies[:lists]).split(',').each do |url|
---
SELECT  "lists".* FROM "lists" WHERE "lists"."url" = ? LIMIT ?  [["url", ""], ["LIMIT", 1]]

	def create
	  @list = List.new(list_params)

	  if @list.save
	  	if !(cookies[:lists].nil?)
	  		a=(cookies[:lists]).split(',')
	  		if (a.size<5)
		  		stuff=cookies[:lists] + ',' + @list.url
		  		cookies[:lists]= stuff
		  	else

		  		a.shift
		  		a.push @list.url
		  		a=a.join(',')
---
INSERT INTO "lists" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "lista"], ["url", "lista"], ["created_at", 2016-12-06 20:05:59 UTC], ["updated_at", 2016-12-06 20:05:59 UTC]]
SELECT  "lists".* FROM "lists" WHERE "lists"."url" = ? LIMIT ?  [["url", ""], ["LIMIT", 1]]

	def update

	  if @list.update(list_params)
---
UPDATE "lists" SET "name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["name", "hola lista k tal"], ["updated_at", 2016-12-08 20:43:27 UTC], ["id", 9]]

	def destroy
	  if !(cookies[:lists].nil?)
		  a=(cookies[:lists]).split(',')
		  a.delete(@list.url)

		  if (a.size>0)
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."url" = ? LIMIT ?  [["url", "liztaa"], ["LIMIT", 1]]