app/controllers/simple_tasks_controller.rb

INSERT INTO "tasks" ("description", "state", "priority", "list_id", "created_at", "updated_at", "type") VALUES (?, ?, ?, ?, ?, ?, ?)  [["description", "ashd"], ["state", "sdfgaj"], ["priority", "dhgfj"], ["list_id", 4], ["created_at", 2016-12-07 20:02:48 UTC], ["updated_at", 2016-12-07 20:02:48 UTC], ["type", "SimpleTask"]]
---
  	def create

	  	@simpleTask=SimpleTask.new(task_params)

		@simpleTask.list_id=@list.id

		if @simpleTask.save

UPDATE "tasks" SET "description" = ?, "priority" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "descripcionnn"], ["priority", "High"], ["updated_at", 2016-12-09 22:03:51 UTC], ["id", 1]]
---
	def update
	  if @simpleTask.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."type" IN ('SimpleTask') AND "tasks"."id" = ?  [["id", 10]]
---
	def destroy
	    @simpleTask.destroy